
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/14282727956)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 15 to add, 0 to change, 5 to destroy.</code></pre>

* Create
  * module.prod__k8s_nodes.null_resource.gateway_provision_ip_routing
  * module.prod__k8s_nodes.null_resource.gateway_provision_ssh_private_key__gateway
  * module.prod__k8s_nodes.null_resource.gateway_provision_ssh_private_key__pve
  * module.prod__k8s_nodes.null_resource.vm_ci_config__control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.null_resource.vm_ci_config__gateway
  * module.prod__k8s_nodes.null_resource.vm_ci_config__worker[&#34;1&#34;]
  * module.prod__k8s_nodes.proxmox_vm_qemu.control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.proxmox_vm_qemu.gateway
  * module.prod__k8s_nodes.proxmox_vm_qemu.worker[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_root_password__control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_root_password__gateway
  * module.prod__k8s_nodes.random_password.vm_root_password__worker[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_user_password__control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_user_password__gateway
  * module.prod__k8s_nodes.random_password.vm_user_password__worker[&#34;1&#34;]
* Delete
  * null_resource.ansible_runner_provision_ssh_private_key
  * null_resource.vm_ci_config__ansible_runner
  * proxmox_vm_qemu.ansible_runner
  * random_password.vm_root_password__ansible_runner
  * random_password.vm_user_password__ansible_runner


<details><summary>Change Result (Click me)</summary>

```hcl

  # null_resource.ansible_runner_provision_ssh_private_key will be destroyed
  # (because null_resource.ansible_runner_provision_ssh_private_key is not in configuration)
  - resource "null_resource" "ansible_runner_provision_ssh_private_key" {
      - id = "439888684647998360" -> null
    }

  # null_resource.vm_ci_config__ansible_runner will be destroyed
  # (because null_resource.vm_ci_config__ansible_runner is not in configuration)
  - resource "null_resource" "vm_ci_config__ansible_runner" {
      - id = "488739596671499334" -> null
    }

  # proxmox_vm_qemu.ansible_runner will be destroyed
  # (because proxmox_vm_qemu.ansible_runner is not in configuration)
  - resource "proxmox_vm_qemu" "ansible_runner" {
      - additional_wait        = 5 -> null
      - agent                  = 1 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "c" -> null
      - bootdisk               = "virtio0" -> null
      - cicustom               = "user=local:snippets/k8s-vm_ci-config__ansible_runner.yaml" -> null
      - ciupgrade              = false -> null
      - clone                  = "alma-9.5" -> null
      - clone_wait             = 10 -> null
      - cores                  = 2 -> null
      - cpu_type               = "x86-64-v3" -> null
      - default_ipv4_address   = "192.168.20.9" -> null
      - define_connection_info = true -> null
      - desc                   = "This VM is managed by Terraform to run k8s." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb,memory,cpu" -> null
      - id                     = "pve-01/qemu/809" -> null
      - ipconfig0              = "ip=192.168.20.9/24,gw=192.168.20.1" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 2048 -> null
      - name                   = "k8s-ansible-runner" -> null
      - numa                   = true -> null
      - onboot                 = true -> null
      - os_type                = "cloud-init" -> null
      - protection             = false -> null
      - qemu_os                = "l26" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_host               = "192.168.20.9" -> null
      - ssh_port               = "22" -> null
      - tablet                 = true -> null
      - tags                   = "k8s;terraform" -> null
      - target_node            = "pve-01" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 809 -> null
        # (10 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = true -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "10G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:53:bc:a4" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "19a33064-9e5a-473d-af5c-12e1b136f01e" -> null
            # (6 unchanged attributes hidden)
        }

      - vga {
          - memory = 0 -> null
          - type   = "serial0" -> null
        }
    }

  # random_password.vm_root_password__ansible_runner will be destroyed
  # (because random_password.vm_root_password__ansible_runner is not in configuration)
  - resource "random_password" "vm_root_password__ansible_runner" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # random_password.vm_user_password__ansible_runner will be destroyed
  # (because random_password.vm_user_password__ansible_runner is not in configuration)
  - resource "random_password" "vm_user_password__ansible_runner" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.prod__k8s_nodes.null_resource.gateway_provision_ip_routing will be created
  + resource "null_resource" "gateway_provision_ip_routing" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.gateway_provision_ssh_private_key__gateway will be created
  + resource "null_resource" "gateway_provision_ssh_private_key__gateway" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.gateway_provision_ssh_private_key__pve will be created
  + resource "null_resource" "gateway_provision_ssh_private_key__pve" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.vm_ci_config__control_plane["1"] will be created
  + resource "null_resource" "vm_ci_config__control_plane" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.vm_ci_config__gateway will be created
  + resource "null_resource" "vm_ci_config__gateway" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.vm_ci_config__worker["1"] will be created
  + resource "null_resource" "vm_ci_config__worker" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.proxmox_vm_qemu.control_plane["1"] will be created
  + resource "proxmox_vm_qemu" "control_plane" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cicustom               = "user=local:snippets/prod__k8s-vm_ci-config__cp-01.yaml"
      + ciupgrade              = false
      + clone                  = "rhel-9.4"
      + clone_wait             = 10
      + cores                  = 3
      + cpu_type               = "x86-64-v3"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.8.11/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 3072
      + name                   = "prod-k8s-cp-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;control_plane"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 811

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.prod__k8s_nodes.proxmox_vm_qemu.gateway will be created
  + resource "proxmox_vm_qemu" "gateway" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cicustom               = "user=local:snippets/prod__k8s-vm_ci-config__gateway.yaml"
      + ciupgrade              = false
      + clone                  = "rhel-9.4"
      + clone_wait             = 10
      + cores                  = 2
      + cpu_type               = "x86-64-v3"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.20.5/24,gw=192.168.20.1"
      + ipconfig1              = "ip=192.168.8.1/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "prod-k8s-gw-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;gateway"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 801

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }
      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.prod__k8s_nodes.proxmox_vm_qemu.worker["1"] will be created
  + resource "proxmox_vm_qemu" "worker" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cicustom               = "user=local:snippets/prod__k8s-vm_ci-config__wk-01.yaml"
      + ciupgrade              = false
      + clone                  = "rhel-9.4"
      + clone_wait             = 10
      + cores                  = 3
      + cpu_type               = "x86-64-v3"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.8.21/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 6144
      + name                   = "prod-k8s-wk-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;worker"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 821

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.prod__k8s_nodes.random_password.vm_root_password__control_plane["1"] will be created
  + resource "random_password" "vm_root_password__control_plane" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_root_password__gateway will be created
  + resource "random_password" "vm_root_password__gateway" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_root_password__worker["1"] will be created
  + resource "random_password" "vm_root_password__worker" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_user_password__control_plane["1"] will be created
  + resource "random_password" "vm_user_password__control_plane" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_user_password__gateway will be created
  + resource "random_password" "vm_user_password__gateway" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_user_password__worker["1"] will be created
  + resource "random_password" "vm_user_password__worker" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 15 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  - k8s_control_plane_nodes__prod = [
      - {
          - host_name = "prod-k8s-cp-01"
          - ip        = "192.168.8.11"
        },
    ] -> null
  - k8s_gateway_node__prod        = {
      - host_name = "prod-k8s-gw-01"
      - ip        = {
          - internal = "192.168.8.1"
          - public   = "192.168.20.5"
        }
    } -> null
  - k8s_worker_nodes__prod        = [
      - {
          - host_name = "prod-k8s-wk-01"
          - ip        = "192.168.8.21"
        },
    ] -> null
  + prod__k8s_control_plane_nodes = [
      + {
          + ip0     = (known after apply)
          + vm_name = "prod-k8s-cp-01"
        },
    ]
  + prod__k8s_gateway_node        = {
      + ip0     = (known after apply)
      + vm_name = "prod-k8s-gw-01"
    }
  + prod__k8s_worker_nodes        = [
      + {
          + ip0     = (known after apply)
          + vm_name = "prod-k8s-wk-01"
        },
    ]
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":89,"Program":"tfcmt","SHA1":"7f4b3c802f367591cb379cbf8eb647ed6b7ef8ce","Vars":{},"WorkflowName":"Terraform CI"} -->